<template>
  <PopUp title="О проете">
    <div class="about">
      <p>
        Добро пожаловать на сайт Filmogram.ru. Здесь вы найдете любой
        фильм или сериал на ваш вкус, для этого на сайте есть удобный
        <router-link to="/search">поисковик</router-link>.
        Также вы можете просматривать коллекции с подборками разных фильмов
        и сериал от других пользователей.
        <router-link to="/auth">Регистрируйтесь</router-link>
        и создавайте собственные коллекции, а также не забывайте делиться
        ими с друзьями. Удачного вам для!
      </p>
      <p>
        Данный проект создан на основе базы данных сайта kinopoisk.ru.
        Сайт создавался одним разработчиком как пет проект и, к сожалению, не доведен до конца,
        поэтому вполне возможны небольшие неполадки, будем рады если вы сообщите нам о них на email
        filmogram.ru@gmail.com или через
        <router-link to="/settings?popUp=support">службу поддержки</router-link>,
        постараемся исправить их как можно скорее. Но не смотря на возможные проблемы,
        сайтом уже можно комфортно пользоваться.
      </p>
      <p>
        Тут реализованы такие фичи как: поиск любых фильмов,
        коллекций пользователей; фильтрация поиска; сохранение фильмов в "любимые" или в ваши коллекции;
        создание, редактирование и управление коллекциями; удобная сортировка фильмов внутри коллекции;
        возможность сохранять понравившиеся коллекции других пользователей; возможность подписки на пользователей;
        возможность закрывать модальные окна свайпом на мобильных устройствах; авторизация, в том числе и через google;
        получение push-уведомлений когда другие пользователи подписываются на вас или сохраняют себе ваши коллекции;
        настройки пользователя (смена имени, пароля, настройки уведомлений); возможность установить сайт как приложение
        на ваше мобильное устройство (PWA); различные анимации и визуальные эффекты; и другое...
      </p>
      <p>
        Сайт создан в 2022 году.
      </p>
    </div>
  </PopUp>
</template>

<script>
import PopUp from "@/components/popUps/PopUp";

export default {
  components: {PopUp}
}
</script>

<style scoped lang="scss">
@import "src/assets/styles/vars";

.about {
  text-align: justify;

  p {
    padding: 0 0 20px 0;
  }

  a {
    color: $color-text-light
  }
}

@media screen and (max-width: 560px) {
  .about {

    p {
      padding: 10px 0;
    }
  }
}
</style>
